print('Задача 6. Полёт')

# Что нужно сделать
# Напишите программу для сервиса заказа билетов,
# которая запрашивает у пользователя город вылета и город прилёта. 
# Затем выведите их в одну строку через тире. 
# Обратите внимание на свои переменные: названия должны отражать содержимое.

name=input('Добрый день, как Вас зовут? ')
print('Очень приятно,',name+'!')

city1=input('Укажите город вылета: ')
city2=input('Укажите город прилета: ')
print('Ваш рейс по маршруту:', city1 + ' - ' + city2 +' забронирован, поздравляем и Желаем Вам приятного полета!')

