print('Задача 5. Вход в систему')

# Что нужно сделать
# Исправьте программу и допишите необходимые команды для получения нужного результата.
# Будьте внимательны при исправлении и помните о правилах названия переменных.

# Программа:

name = input('Введите имя пользователя: ')
hi = 'Привет,'
print(hi, name)
print('К сожалению, у Вас нет доступа к системе.')
print('Пожалуйста, обратитесь к системному администратору.')

# Ожидаемый результат: 

# Введите имя пользователя: Роман
# Привет, Роман
# К сожалению, у Вас нет доступа к системе.
# Пожалуйста, обратитесь к системному администратору.
