#Первый вариант
print('==============================')
print('Привет')
print('друг')
print('==============================')
#Второй вариант
print('==============================')
print('||          Привет          ||')
print('||          друг!           ||')
print('==============================')
#Третий вариант
print('==============================')
print('||                          ||')
print('||                          ||')
print('||          Привет          ||')
print('||          друг!           ||')
print('||                          ||')
print('||                          ||')
print('==============================')
